/*  Задание 1
Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
Таблицы: Н_ЛЮДИ, Н_СЕССИЯ.
Вывести атрибуты: Н_ЛЮДИ.ИД, Н_СЕССИЯ.ЧЛВК_ИД.
Фильтры (AND):
a) Н_ЛЮДИ.ИД > 163484.
b) Н_СЕССИЯ.ДАТА > 2012-01-25.
Вид соединения: RIGHT JOIN.
 */

SELECT "Н_ЛЮДИ"."ИД", "Н_СЕССИЯ"."ЧЛВК_ИД"
FROM  "Н_ЛЮДИ"
RIGHT JOIN  "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИД" > 163484
AND "Н_СЕССИЯ"."ДАТА" > '2012-01-25';

CREATE INDEX "ИНДЕКС_ЛЮДИ" ON "Н_ЛЮДИ" USING hash("ИД");
CREATE INDEX "ИНДЕКС_СЕССИЯ_ЧЛВК" ON "Н_СЕССИЯ" USING hash("ЧЛВК_ИД");
CREATE INDEX "ИНДЕКС_ЛЮДИ_ИД" ON "Н_ЛЮДИ" USING btree("ИД");
CREATE INDEX "ИНДЕКС_СЕССИЯ_ДАТА" ON "Н_СЕССИЯ" USING btree("ДАТА");


EXPLAIN ANALYSE
SELECT "Н_ЛЮДИ"."ИД", "Н_СЕССИЯ"."ЧЛВК_ИД"
FROM  "Н_ЛЮДИ"
RIGHT JOIN  "Н_СЕССИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_СЕССИЯ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ИД" > 163484
AND "Н_СЕССИЯ"."ДАТА" > '2012-01-25';

/*  Задание 2
Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
Таблицы: Н_ЛЮДИ, Н_ОБУЧЕНИЯ, Н_УЧЕНИКИ.
Вывести атрибуты: Н_ЛЮДИ.ФАМИЛИЯ, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.НАЧАЛО.
Фильтры: (AND)
a) Н_ЛЮДИ.ОТЧЕСТВО < Сергеевич.
b) Н_ОБУЧЕНИЯ.НЗК < 001000.
c) Н_УЧЕНИКИ.ГРУППА = 1101.
Вид соединения: INNER JOIN.
 */

SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."НАЧАЛО"
FROM "Н_ЛЮДИ"
INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
INNER JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" < 'Сергеевич'
  AND "Н_ОБУЧЕНИЯ"."НЗК" < '001000'
  AND "Н_УЧЕНИКИ"."ГРУППА" = '1101';

CREATE INDEX "ИНДЕКС_ЛЮДИ" ON "Н_ЛЮДИ" USING hash("ИД");
CREATE INDEX "ИНДЕКС_ОБУЧЕНИЯ" ON "Н_ОБУЧЕНИЯ" USING hash("ЧЛВК_ИД");
CREATE INDEX "ИНДЕКС_УЧЕНИКИ" ON "Н_УЧЕНИКИ" USING hash("ЧЛВК_ИД");
CREATE INDEX "ИНДЕКС_ЛЮДИ_ОТЧЕСТВО" ON "Н_ЛЮДИ" USING btree("ОТЧЕСТВО");
CREATE INDEX "ИНДЕКС_УЧЕНИКИ_ГРУППА" ON "Н_УЧЕНИКИ" USING btree("ГРУППА");
CREATE INDEX "ИНДЕКС_ОБУЧЕНИЯ_НЗК" ON "Н_ОБУЧЕНИЯ" USING btree("НЗК");

EXPLAIN ANALYZE
SELECT "Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД", "Н_УЧЕНИКИ"."НАЧАЛО"
FROM "Н_ЛЮДИ"
INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
INNER JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
WHERE "Н_ЛЮДИ"."ОТЧЕСТВО" < 'Сергеевич'
  AND "Н_ОБУЧЕНИЯ"."НЗК" < '001000'
  AND "Н_УЧЕНИКИ"."ГРУППА" = '1101';

